import re
# +为出现一次或者多次   *为零次或者多次   ？为0次或者1次
# 竖线表示或者
 # \d表示数字，\w表示字符，  . 表示匹配除了换行符之外的任意字符

# 一个小知识：\d[1-3] 的意思并不是匹配数字1到3，而是匹配一个个位为1到3两位数。即\d匹配一个数字，[1,3]匹配该范围的一个数字。
text_1 = '398025732398547899203918319528354298zbjkdbqfiabdvjndvldzdahoqialaljaidj31471593450'
request1 = re.findall(r'(\d[1-2])|[a-c]',text_1)
print(request1,'\n')
print('-'*30)

#小知识： \d{3}的意思是匹配三位数,# \d{1,4} 的意思为匹配1到4个数字，\d{1,} 为至少一个数字，\d{,4}的意思为 0到4个数字，特别注意是零
text_2 = '123641764781648716736417-2734627182389-283789237'
request2 = re.findall(r'\d{3,4}-\d{8}',text_2)
print("第二次输出：",request2)
print('-'*30)

text_3=('1376288351516846lrkkgfnok-45'
        '4we-wfkdlmblkwrbwkldfmblknwfdlkbnjknkwmflkbmk'
        'wkmbklmwlktrmbjpw[4[4kwelr;mbl;wdf;-51554454-1564165164865'
        '18711975145')
request3=re.findall(r'(\d{3}-\d{6})|(1\d{10})',text_3) #在此处使用'|'时一定要注意运算顺序，使用括号来避
                                                              # 免逻辑错误，此处实际将第一个部分括起来就能解决
print("第三次输出：",request3)
print('-'*30)

# (\d)(\1)其中(\1)的意思为匹配第一个括号的内容，(\d)(\1)|(\w)(\3)中的(\3)匹配着(\w)，即第三个括号
text_4='2345234754442879995249544873455ajdfhgaahjkaoojdfhgjkk'
request4=re.findall(r'(\d)(\1)|(\w)(\3)',text_4)
print(request4)
print("-"*30)


#  此代码存在的问题以及解决方法：
# 当你的正则表达式中包含捕获组（即使用了括号 ()）时，re.findall() 的行为会发生改变：
# 它不再返回完整的匹配结果。
# 它只会返回捕获组中匹配到的内容。
# 如果正则表达式中使用了 |（或）连接了多个带括号的子表达式，那么每次匹配只会触发其中一个分支。
# 对于没有参与匹配的那个分支的括号，findall 会返回一个空字符串 '' 作为占位符。
# 解决方法:
# 当我们不需要括号来限制运算顺序的时候，我们直接不写括号，当我们需要使用括号来限制顺序时，我们在括号内加入  ？： ，当然更加推荐不加多余的括号。
# 例如：
request5=re.findall(r'(?:\d{3}-\d{6})|(?:1\d{10})',text_3)
print("这是消除莫名空字符的改进",request5)